{
  "results": [
    {
      "name": "BBC News",
      "url": "http://www.bbc.co.uk/news",
      "role": "Principal Developer",
      "startDate": "2014-08-01",
      "image": "images/bbc-news.png",
      "description": "As the development lead for the BBC News front page rebuild, I am working closely with stakeholders and developers to deliver this critical project. The new front page is built using isomorphic React components which have been designed to be shared between various BBC products including News, Sport, Weather, and Live. The front-end is being built to be maintainable and performant by using the <a href=\"https://medium.com/@shaunbent/css-at-bbc-sport-part-1-bab546184e66\">Grandstand CSS framework</a>.\n\nI have also worked for BBC World Service, where I architected a cloud-based feed aggregation service and helped to build and deliver the BBC's 31 international responsive news websites."
    },
    {
      "name": "Rightster",
      "url": "http://rightster.com/",
      "role": "Senior Developer",
      "image": "images/rightster.png",
      "startDate": "2013-12-01",
      "endDate": "2014-08-01",
      "description": "At Rightster I helped to architect and build the front-end for the company's video distribution platform. We used Zend Framework 2 as a domain logic & presentation layer, and made extensive use of AngularJS to build rich user interfaces.\n\nThe project consisted of over 20,000 lines of JavaScript, which we managed by adhering to a solid architecture around small, well-tested components."
    },
    {
      "name": "Time Inc. UK",
      "url": "http://www.timeincuk.com/",
      "role": "Senior Developer",
      "image": "images/time-inc-uk.png",
      "startDate": "2012-05-01",
      "endDate": "2013-12-01",
      "description": "At Time Inc. I worked on building out a new API-driven mobile website platform. During this project I became interested in automated testing as a way to improve the quality of our products. I wrote a smoke test tool which uses PhantomJS to check for common page-level errors, and takes a screenshot of each page to aid manual visual checks. This helped catch bugs quickly, and enabled us to deploy the platform several times a day with confidence.\n\nI also introduced JavaScript unit testing to the engineering department and encouraged more automated testing during the monthly developer gathering. The slides from my talk are <a href=\"http://slid.es/wildlyinaccurate/automated-javascript-testing\">available here</a>."
    },
    {
      "name": "Chroma",
      "url": "http://www.chromasports.com/",
      "role": "Developer",
      "image": "images/chroma.png",
      "startDate": "2011-04-01",
      "endDate": "2012-05-01",
      "description": "At Chroma I was involved in designing and building an interface for bookmakers to monitor and set pricing in real time. The real-time aspect of this system was achieved using long polling, which allowed us to support legacy web browsers.\n\nI also used the Campaign Monitor API to build a module for the ExpressionEngine CMS which allowed editors to create and manage their email campaigns from a familiar interface."
    },
    {
      "name": "Zeevo",
      "url": "http://www.zeevo.co.nz/",
      "role": "Developer",
      "image": "images/zeevo.png",
      "startDate": "2010-06-01",
      "endDate": "2011-04-01",
      "description": "Using the CodeIgniter framework and Doctrine ORM, I helped to build a <a href=\"http://book.totallytourism.co.nz/\">booking and scheduling system</a> used by tourism operators around New Zealand.\n\nI was also involved in designing and building a secure file sharing application using the Dropbox API."
    }
  ]
}
