{
  "results": [
    {
      "name": "BBC News",
      "url": "http://www.bbc.co.uk/news",
      "role": "Principal Software Engineer",
      "startDate": "2014-08-01",
      "image": "images/bbc-news.png",
      "description": "I lead the engineering team rebuilding the front page of BBC News with a rigorous focus on performance. The new front page is <a href=\"https://wildlyinaccurate.com/introducing-a-faster-bbc-news-front-page/\">significantly faster</a>, and drives better user engagement: bounce rate is down 2% and weekly return visits are up 9%. The front page is built with Node.js, composed of React components that are shared through an internal open source system. The components are exposed as HTTP endpoints and assembled by a <a href=\"https://wildlyinaccurate.com/how-we-assemble-web-pages-at-bbc-news/\">page composition service</a>.\n\nI oversaw technical delivery of projects including defining the technical architecture and building continuous integration pipelines. I developed core features, mentored developers, defined code structure, and worked closely with other teams to deliver related features.\n\nThe tech stack included Node.js, Ruby, Go, AWS (EC2, ELB, S3, DynamoDB), Docker."
    },
    {
      "name": "Rightster",
      "url": "http://rightster.com/",
      "role": "Senior Developer",
      "image": "images/rightster.png",
      "startDate": "2013-12-01",
      "endDate": "2014-08-01",
      "description": "When I joined Righster I took control of their video distribution front-end by introducing a modular architecture based on AngularJS and RequireJS. This enabled the team to effectively manage tens of thousands of lines of JavaScript without compromising on build speed or quality. I worked closely with the platform team to ensure their APIs enabled us to build an efficient presentation middle layer.\n\nI introduced a Git workflow that streamlined our deployment process and reduced defects by cutting releases from a single branch and enforcing code reviews before merges.\n\nThe tech stack included PHP on the Zend 2 framework, PostgreSQL, Lucene, ElasticSearch, and deployments to EC2 instances."
    },
    {
      "name": "Time Inc. UK",
      "url": "http://www.timeincuk.com/",
      "role": "Senior Developer",
      "image": "images/time-inc-uk.png",
      "startDate": "2012-05-01",
      "endDate": "2013-12-01",
      "description": "At Time Inc. I worked on building out a new API-driven mobile web site platform. During this project I became interested in automated testing as a way to improve the quality of our products. I wrote a smoke test tool that uses PhantomJS to check for common page-level errors, and takes a screenshot of each page to aid manual visual checks. This helped catch bugs quickly, and enabled us to deploy the platform several times a day with confidence.\n\nI also introduced JavaScript unit testing to the engineering department and encouraged more automated testing during the monthly developer gathering. The slides from my talk are <a href=\"http://slid.es/wildlyinaccurate/automated-javascript-testing\">available here</a>."
    },
    {
      "name": "Chroma",
      "url": "http://www.chromasports.com/",
      "role": "Developer",
      "image": "images/chroma.png",
      "startDate": "2011-04-01",
      "endDate": "2012-05-01",
      "description": "Working in a small close-knit team I architected and built a web interface used by bookmakers around the UK to monitor and set pricing in real time. To support legacy browsers, I chose to implement a long polling mechanism to achieve the \"real time\" functionality.\n\nI also worked closely with Chroma's clients to create bespoke modules for the ExpressionEngine CMS, including an interface for managing email campaigns using the Campaign Monitor API, and a membership management tool for Racing UK Club."
    },
    {
      "name": "Zeevo",
      "url": "http://www.zeevo.co.nz/",
      "role": "Developer",
      "image": "images/zeevo.png",
      "startDate": "2010-06-01",
      "endDate": "2011-04-01",
      "description": "Using the CodeIgniter PHP framework and Doctrine ORM, I helped to build a <a href=\"http://book.totallytourism.co.nz/\">booking and scheduling system</a> used by tourism operators around New Zealand.\n\nI was also involved in architecting and building a secure file sharing application using the Dropbox API."
    }
  ]
}
